Repository: NERC-CEH/floating-weeds-app
Catalog: src/common/translations/interface/*.po
Languages: sw_ke

source: Welcome to Floating Weeds!
sw_ke: Karibu kwenye Magugu Yanayoelea!

source: Floating weeds choke waterways and damage ecosystems. With the Floating Weeds app, your sightings help guide real-world solutions and satellite-based monitoring.
sw_ke: Magugu yanayoelea husonga njia za maji na kuharibu mifumo ikolojia. Ukiwa na programu ya Magugu Yanayoelea, utazamaji wako husaidia kuelekeza masuluhisho ya ulimwengu halisi na ufuatiliaji unaotegemea satelaiti.

source: The language will default to the language of your phone settings. If you want to change the language go to "Settings" in the app menu and select "Language".
sw_ke: Lugha itakuwa chaguomsingi kwa lugha ya mipangilio ya simu yako. Ikiwa unataka kubadilisha lugha, nenda kwa "Mipangilio" kwenye menyu ya programu na uchague "Lugha".

source: Back
sw_ke: Nyuma

source: Home
sw_ke: Ukurasa wa mwanzo

source: Map
sw_ke: Ramani

source: If you are still not sure after looking at this guide please submit the record anyway
sw_ke: Iwapo bado hauna uhakika hata baada ya kuangalia maelezo haya, tafadhali tuma tu ulionakili hata hivyo.

source: Pending
sw_ke: Haijakamilishwa

source: Uploaded
sw_ke: Imepakiwa

source: Draft
sw_ke: Rasimu

source: To delete any records swipe it to the left.
sw_ke: – Ili kufuta rekodi yoyote, telezesha kwenda upande wa kushoto.

source: Settings
sw_ke: Mipangilio

source: English
sw_ke: Kiingereza

source: Language
sw_ke: Lugha

source: Share app crash data so we can make the app more reliable.
sw_ke: Shiriki data za hitilafu za programu ili tuiimarishe zaidi.

source: Reset App
sw_ke: Weka upya programu

source: Share App Analytics
sw_ke: Shiriki takwimu za matumizi ya programu

source: Cancel
sw_ke: Ghairi

source: No uploaded records
sw_ke: Hakuna rekodi zilizopakiwa

source: Discard
sw_ke: Tupa

source: Continue
sw_ke: Endelea

source: Previous record draft exists, would you like to continue it?
sw_ke: Rasimu ya rekodi iliyopita ipo, ungependa kuendelea nayo?

source: No photo has been added.
sw_ke: Hakuna picha iliyoongezwa.

source: Press <1></1> to add.
sw_ke: Bonyeza 1 1 ili kuongeza.

source: Location
sw_ke: Mahali

source: Today
sw_ke: Leo

source: Date
sw_ke: Tarehe

source: Activities
sw_ke: Shughuli

source: Comment
sw_ke: Maoni

source: Please add any extra info about this record.
sw_ke: Tafadhali ongeza maelezo ya ziada kuhusu rekodi hii.

source: Enter more information here...
sw_ke: Ingiza maelezo zaidi hapa...

source: What activities were you doing?
sw_ke: Ni shughuli gani ulikuwa unafanya?

source: Walking / Running
sw_ke: Kutembea / Kukimbia

source: Dog-walking
sw_ke: Kutembea na mbwa

source: Cycling
sw_ke: Kuendesha baiskeli

source: Birdwatching
sw_ke: Kutazama ndege

source: Fishing
sw_ke: Kuvua samaki

source: Swimming
sw_ke: Kuogelea

source: Boats / Watersports
sw_ke: Boti / Michezo ya maji

source: Other
sw_ke: Nyingine

source: Got it!
sw_ke: Nimeelewa!

source: Delete
sw_ke: Futa

source: No finished pending records.
sw_ke: Hakuna rekodi za kusubiri zilizokamilika.

source: Record incomplete
sw_ke: Rekodi haijakamilika

source: Incorrect
sw_ke: Si sahihi

source: Correct
sw_ke: Sahihi

source: Navigate
sw_ke: Ogelea au elekeza

source: App version
sw_ke: Toleo la programu

source: Are you sure you want to delete this record ?
sw_ke: Je, unahakikisha kuwa unataka kufuta rekodi hii?

source: Upload
sw_ke: Pakia

source: OK
sw_ke: Sawa

source: DD/MM/YYYY
sw_ke: Siku/Mwezi/Mwaka

source: Record
sw_ke: Rekodi

source: Done
sw_ke: Imekamilika

source: Hide
sw_ke: Ficha

source: All Records
sw_ke: Rekodi Zote

source: See past 12 months
sw_ke: Tazama miezi 12 iliopita

source: The default setting is the past 4 weeks of records.
sw_ke: Mipangilio chaguomsingi ni rekodi za wiki 4 zilizopita

source: Please confirm this is your correct location.
sw_ke: Tafadhali dhibitisha kuwa hapa ni eneo ulipo

source: This record has no images.
sw_ke: Rekodi hii haina picha

source: Do not show again
sw_ke: Usionyeshe tena

source: rejected
sw_ke: Kukataliwa

source: complete
sw_ke: Kamili

source: plausible
sw_ke: Inayokubalika

source: verified
sw_ke: Imethibitishwa

source: Register/Login
sw_ke: Jisajili/Ingia

source: Login
sw_ke: Ingia

source: Register
sw_ke: Jisajili

source: Sign in
sw_ke: Ingia

source: First Name
sw_ke: Jina la kwanza

source: Surname
sw_ke: Jina la familia

source: Reset
sw_ke: Weka upya

source: Create a free account
sw_ke: Tengeneza akaunti ya bure

source: First name
sw_ke: Jina la kwanza

source: Last name
sw_ke: Jina la mwisho

source: Email
sw_ke: Barua pepe

source: Password
sw_ke: Nenosiri

source: By clicking Sign Up, you agree to our <2>Privacy Policy</2> and <6>Terms and Conditions</6>
sw_ke: Kwa kubonyeza jisajili, unakubaliana na <2>sera yetu ya faragha</2> na <6>Sheria na masharti yetu

source: Sign Up
sw_ke: isajili

source: I am already a member
sw_ke: Tayari mimi ni mwanachama

source: Sign In
sw_ke: Ingia

source: Welcome back
sw_ke: Karibu tena

source: Sign in to your account to start
sw_ke: Ingia kwenye akaunti yako ili kuanza

source: Forgot password?
sw_ke: Umesahau neno siri?

source: firstName is a required field
sw_ke: Jina la kwanza ni sharti

source: Enter your email address to request a password reset.
sw_ke: Ingiza barua pepe yako ili kuomba kuweka upya nenosiri.

source: email is a required field
sw_ke: Barua pepe ni sharti

source: password is a required field
sw_ke: Nenosiri ni sharti

source: secondName is a required field
sw_ke: Jina la pili ni sharti

source: Logout
sw_ke: Toka kwenye akaunti

source: Are you sure you want to logout?
sw_ke: Je, unahakikisha unataka kutoka kwenye akaunti?

source: Discard local data
sw_ke: Futa data za ndani

source: Please wait...
sw_ke: Tafadhali subiri..

source: Finish
sw_ke: Maliza

source: Choose a method to upload a photo
sw_ke: Chagua njia ya kupakia picha

source: No photo has been added.<br/>Press <4><0></0></4> to add.
sw_ke: Hakuna picha iliyoongezwa.<br/>Bonyeza <4><0></0></4> ili kuongeza.

source: Location name e.g. lake, reservoir or pond name
sw_ke: Jina la eneo, mfano: ziwa, bwawa au dimbwi

source: Map Settings
sw_ke: Mipangilio ya Ramani

source: Map Type
sw_ke: Aina ya ramani

source: Standard
sw_ke: Kiwango

source: Satellite
sw_ke: satelaiti

source: Gallery
sw_ke: Kichanja cha picha

source: Camera
sw_ke: Kamera

source: Please do not forget to upload any pending records!
sw_ke: Tafadhali usisahau kupakia rekodi zozote zilizosalia!

source: OK, got it
sw_ke: Sawa, nimeelewa

source: Sorry
sw_ke: Samahani

source: Unauthorized
sw_ke: Hujaruhusiwa

source: Not found
sw_ke: Haijapatikana

source: Bad Request
sw_ke: Ombi si sahihi

source: Some of your records have been verified. Please check your records list.
sw_ke: Baadhi ya rekodi zako zimethibitishwa. Tafadhali angalia orodha ya rekodi zako.

source: Yesterday
sw_ke: Jana

source: Are you sure you want to remove this photo?
sw_ke: Je, una uhakika unataka kuondoa picha hii?

source: Note: it will remain in the gallery.
sw_ke: Kumbuka: Itabaki kwenye kichanja cha picha.

source: This record has been uploaded and can not be edited.
sw_ke: Rekodi hii imepakiwa na haiwezi kuhaririwa.

source: Successfully logged in
sw_ke: Umeingia kwa mafanikio

source: Please fill in
sw_ke: Tafadhali jaza

source: email must be a valid email
sw_ke: Barua pepe lazima iwe sahihi

source: You can delete your user account from the system.
sw_ke: Unaweza kufuta akaunti yako ya mtumiaji kutoka kwenye mfumo.

source: Account delete
sw_ke: Kufuta akaunti

source: Delete account
sw_ke: Futa akaunti

source: Are you sure you want to delete your account?
sw_ke: Je, una hakika unataka kufuta akaunti yako?

source: This will remove your account on the iRecord website. You will lose access to any records that you have previously submitted using the app or website.
sw_ke: Hii itaondoa akaunti yako kwenye tovuti ya iRecord. Utapoteza ufikiaji wa rekodi zozote ulizowahi kuwasilisha kwa kutumia programu au tovuti.

source: Sorry, we couldn't get the image.
sw_ke: Samahani, hatukuweza kupata picha.

source: Welcome aboard
sw_ke: Karibu kwenye programu

source: The language will default to the language of your phone settings. If you want to change the language go to "Settings" in the Bloomin' Algae app menu and select "Language"
sw_ke: Lugha itawekwa kuwa ile iliyopo kwenye mipangilio ya simu yako kwa chaguomsingi. Ikiwa unataka kubadilisha lugha, nenda kwenye "Mipangilio" katika menyu ya programu ya Bloomin' Algae na uchague "Lugha".

source: Before starting any records please check your email and click on the verification link.
sw_ke: Kabla ya kuanza rekodi yoyote, tafadhali angalia barua pepe yako na ubofye kiungo cha uthibitisho.

source: email is not valid
sw_ke: Barua pepe si sahihi

source: Before starting any surveys please check your email and click on the verification link.
sw_ke: Kabla ya kuanza uchunguzi wowote, tafadhali angalia barua pepe yako na ubofye kiungo cha uthibitisho.

source: Resend
sw_ke: Tuma tena

source: Looks like your email hasn't been verified yet.
sw_ke: Inaonekana barua pepe yako bado haijathibitishwa.

source: Should we resend the verification email?
sw_ke: Je, tutume tena barua pepe ya uthibitisho?

source: A new verification email was successfully sent now. If you did not receive the email, then check your Spam or Junk email folders.
sw_ke: Barua pepe mpya ya uthibitisho imetumwa kwa mafanikio sasa. Ikiwa hujapokea barua pepe, tafadhali angalia folda ya barua taka au barua pepe zisizohitajika.

source: Add species
sw_ke: Ongeza aina

source: Your species list is empty. <br/> tap the "Add species" button to add one.
sw_ke: Orodha yako ya aina ni tupu. <br/> gusa kitufe cha "Ongeza aina" ili kuongeza moja.

source: What activities are done at this location?
sw_ke: Ni shughuli gani zinafanyika katika eneo hili?

source: Species
sw_ke: Aina

source: Nile cabbage (Pistia stratiates)
sw_ke: Kabichi ya Nile (Pistia stratiates)

source: Papyrus (Cyperus papyrus)
sw_ke: Matete (Cyperus papyrus)

source: Water ferns (Azolla sp.)
sw_ke: Feni za maji (Azolla sp.)

source: Water hyacinth (Pontederia crassipes)
sw_ke: Gugu maji (Pontederia crassipes)

source: Water Lettuce (Pistia stratiotes)
sw_ke: Nyasi ya maji (Pistia stratiotes)

source: Watermosses (Salvinia sp.)
sw_ke: Majimaji (Salvinia sp.)

source: Edit Species
sw_ke: Hariri au kagua aina

source: Quantity
sw_ke: Kiasi

source: Certainty
sw_ke: Uhakika

source: Papyrus
sw_ke: Matete

source: Report incomplete
sw_ke: Ripoti haijakamilika

source: Got it
sw_ke: Nimeielewa!

source: Please add at least one photo of the species
sw_ke: Tafadhali ongeza angalau picha moja ya aina

source: Please add at least one species
sw_ke: Tafadhali ongeza angalau aina moja

source: Water ferns
sw_ke: Feni za maji

source: Nile cabbage
sw_ke: Kabichi ya Nile

source: Water hyacinth
sw_ke: Magugu ya maji

source: Water Lettuce
sw_ke: Majimaji

source: Watermosses
sw_ke: Majimaji

source: Salvinia sp.
sw_ke: Aina ya Salvinia

source: User
sw_ke: Mtumiaji

source: Info
sw_ke: Taarifa

source: About
sw_ke: Kuhusu

source: What do we use your records for?
sw_ke: Tunatumia rekodi zako kwa nini?

source: Credits
sw_ke: Shukrani

source: BRC approved
sw_ke: BRC Imeidhinishwa

source: Privacy Policy
sw_ke: Sera ya Faragha

source: App
sw_ke: Programu

source: Are you sure you want to logout?<br/><br/>Your pending and uploaded <4>surveys will not be deleted </4> from this device.
sw_ke: Je, una uhakika unataka kuondoka?<br/><br/>Tafiti zako zinazosubiri na zilizopakiwa <4>hazitafutwa </4> kutoka kwa kifaa hiki.

source: Floating Weeds is a Citizen Science app for reporting the presence of floating weeds such as water hyacinth. The records you send in help to target the monitoring and eradication of these weeds. You will receive feedback on the records you submit; this can help you learn how to recognise the different floating and emergent plants and look for patterns in their appearance.
sw_ke: Magugu Yanayoelea ni programu ya Sayansi ya Mwananchi kwa kuripoti uwepo wa magugu yanayoelea kama vile gugu maji. Rekodi unazotuma husaidia kulenga ufuatiliaji na kutokomeza magugu haya. Utapokea maoni kuhusu rekodi unazowasilisha; hii inaweza kukusaidia kujifunza jinsi ya kutambua mimea tofauti inayoelea na inayochipuka na kutafuta ruwaza katika mwonekano wake.

source: As well as submitting an image, location and date, we ask you to confirm what general activities you, or others, are carrying out in, or around, the water (such as dog walking, fishing, kayaking). By gathering details of activities undertaken we hope to gain a better understanding of how floating weeds are affecting the use of freshwaters. For example, floating weeds can block waterways and get tangled in boat propellers causing damage and disruption.
sw_ke: Pamoja na kuwasilisha picha, eneo na tarehe, tunakuomba uthibitishe ni shughuli zipi za jumla ambazo wewe, au wengine, mnafanya ndani, au karibu na maji (kama vile kutembea kwa mbwa, uvuvi, kayaking). Kwa kukusanya maelezo ya shughuli zilizofanywa tunatumai kupata ufahamu bora wa jinsi magugu yanayoelea yanavyoathiri matumizi ya maji baridi. Kwa mfano, magugu yanayoelea yanaweza kuzuia njia za maji na kuchanganyikiwa kwenye panga boti na kusababisha uharibifu na usumbufu.

source: Your records will help us verify and improve the accuracy of our satellite derived floating weed maps on the <2>Floating Weed Manager</2> portal. Your anonymised records will also be added to the portal’s map.
sw_ke: Rekodi zako zitatusaidia kuthibitisha na kuboresha usahihi wa ramani zetu za magugu zinazoelea zinazotokana na setilaiti kwenye <2>Lango la msimamizi wa magugu yanayoelea</2> Rekodi zako ambazo hazikutambulisha zitaongezwa kwenye ramani ya tovuti hiyo.

source: When you submit a record, it is stored within the iRecord website where it will be displayed to users, and examined and verified by an expert. Only your records are available publicly, not your contact details. Although records may be collated and disseminated for use in education, scientific research and other activities of benefit to the public, your contact details will not be shared.
sw_ke: Unapowasilisha rekodi, huhifadhiwa ndani ya tovuti ya iRecord ambapo itaonyeshwa kwa watumiaji, na kuchunguzwa na kuthibitishwa na mtaalamu. Rekodi zako pekee ndizo zinazopatikana kwa umma, sio maelezo yako ya mawasiliano. Ingawa rekodi zinaweza kukusanywa na kusambazwa kwa matumizi ya elimu, utafiti wa kisayansi na shughuli nyingine za manufaa kwa umma, maelezo yako ya mawasiliano hayatashirikiwa.

source: <0><0>To get a better understanding of the timing and location of floating weeds; this helps us understand how climate change is affecting their growth and distribution, and helps prediction of future impacts.</0><br/><2>To support environment agencies and water companies in water quality and floating weed risk management and prevention.</2><br/><4>To help monitor and eradicate floating weeds more efficiently, helping to keep canals and waterways clear.</4></0>
sw_ke: <0><0>Ili kupata ufahamu bora wa muda na eneo la magugu yanayoelea; hii hutusaidia kuelewa jinsi mabadiliko ya hali ya hewa yanavyoathiri ukuaji na usambazaji wao, na husaidia kutabiri athari za siku zijazo. </0><br/><2>Kusaidia mashirika ya mazingira na makampuni ya maji katika ubora wa maji na usimamizi na kuzuia hatari ya magugu yanayoelea.</2><br/><4>Ili kusaidia kufuatilia na kutokomeza magugu yanayoelea kwa ufanisi zaidi, kusaidia kuweka mifereji na njia za maji wazi.</4></0>

source: The project would like to thank UKCEH, KMFRI and USACE for their advice and guidance during the development of the app.
sw_ke: Mradi ungependa kuwashukuru UKCEH, KMFRI na USACE kwa ushauri na mwongozo wao wakati wa kuunda programu.

source: We are grateful to all the people that helped to create this app:
sw_ke: Tunawashukuru watu wote waliosaidia kuunda programu hii:

source: Home photo by <2>DEBRAJ PURKAYASTHA</2> on <6>Unsplash</6>
sw_ke: Picha ya mwanzo au nyumbani na <2>DEBRAJ PURKAYASTHA</2> kwenye<6>pasiponyunyiza</6>

source: <0><0><0></0></0></0>This app was hand crafted with love by <3>Flumens.</3> A technical consultancy that excels at building bespoke environmental science and community focussed solutions. For suggestions and feedback please do not hesitate to <7>contact us</7>.
sw_ke: <0><0><0></0></0></0>Programu hii iliundwa kwa mkono kwa upendo na<3>Flumens.</3>Mshauri wa kiufundi ambaye hufaulu katika kujenga sayansi ya mazingira iliyopendekezwa na masuluhisho yaliyolengwa na jamii. Kwa mapendekezo na maoni tafadhali usisite ku <7>wasiliana nasi</7>.

source: Wherever you see this logo on a biological recording app you can be assured that the data you submit will be: made available to experts for quality assurance; made available for conservation and research and preserved for long-term use.
sw_ke: Popote unapoona nembo hii kwenye programu ya kurekodi data za kibiolojia, unaweza kuwa na uhakika kuwa data unazowasilisha zitapatikana kwa: Wataalamu kwa ajili ya uhakiki wa ubora; Uhifadhi wa mazingira na utafiti; Matumizi ya muda mrefu.

source: This logo indicates that your data is:<1><0>Sent to the Biological Record Centre’s data warehouse linked to the iRecord system where it is accessible to you as the recorder, to an expert community of verifiers and other users of iRecord.</0><1>Quality assured data is passed onto Local Environmental Records Centres, National Recording Schemes and to the NBN Gateway.</1></1>
sw_ke: Nembo hii inaonyesha kuwa data yako ime:<1><0>Imetumwa kwa ghala la data la Kituo cha Rekodi za Biolojia iliyounganishwa na mfumo wa iRecord ambapo unaweza kuipata kama kinasa sauti, kwa jumuiya ya wataalamu wa wathibitishaji na watumiaji wengine wa iRecord.</0><1>Data iliyohakikishwa ubora hupitishwa kwenye Vituo vya Rekodi za Mazingira za Mitaa, Miradi ya Kitaifa ya Kurekodi na kwa Lango la NBN.</1></1>

source: About BRC
sw_ke: Kuhusu BRC

source: The <1>Biological Records Centre</1> (BRC), established in 1964, is a national focus in the UK for terrestrial and freshwater species recording. BRC works closely with the voluntary recording community, principally through support of national recording schemes and societies. BRC is supported by the Joint Nature Conservation Committee (JNCC) and the Centre for Ecology & Hydrology (UKCEH). The work of BRC is a major BRC of the National Biodiversity Network (NBN).
sw_ke: <1>Kituo cha Rekodi za Biolojia</1> (BRC), kilichoanzishwa mwaka 1964, ni kituo kikuu nchini Uingereza kwa ajili ya kurekodi spishi au aina za viumbe ardhini na maji safi. BRC hufanya kazi kwa karibu na jumuiya ya kurekodi kwa hiari, hasa kupitia usaidizi wa mipango ya kitaifa ya kurekodi na jamii. BRC inaungwa mkono na Kamati ya Pamoja ya Uhifadhi wa Mazingira (JNCC) na Kituo cha Ikolojia na Hydrology (UKCEH). Kazi ya BRC ni BRC kuu ya Mtandao wa Kitaifa wa Bioanuwai (NBN).

source: Which app should I use?
sw_ke: Ni programu gani ninapaswa kutumia?

source: You might have noticed that several of<1> BRC apps</1> feature some of the same species? We have introduced the BRC Approved logo to signify that data from our apps all go to the same place. Therefore, you are free to choose which app you use to record a given species. All records will be sent to the same place, treated in the same way and will meet the established standards required by the Biological Record Centre.
sw_ke: Unaweza kuwa uligundua kwamba kadhaa ya<1> programu za BRC </1> zinaonyesha baadhi ya aina zilezile? Tumeanzisha nembo Iliyoidhinishwa na BRC ili kuashiria kuwa data kutoka kwa programu zetu zote huenda mahali pamoja. Kwa hivyo, uko huru kuchagua programu unayotumia kurekodi aina fulani. Rekodi zote zitatumwa mahali pamoja, zitachukuliwa kwa njia sawa na zitafikia viwango vilivyowekwa vinavyohitajika na Kituo cha Rekodi za Biolojia.

source: Swahili
sw_ke: Kiswahili

source: Share with app developers
sw_ke: Shiriki na watengenezaji wa programu.

source: Export database
sw_ke: hifadhidata ya usafirishaji

source: Export
sw_ke: Hamisha

source: Are you sure you want to export the data?<1>This feature is intended solely for technical support and is not a supported method for exporting your data</1>
sw_ke: Je, una uhakika unataka kuhamisha data?<1>Kipengele hiki kimekusudiwa kwa usaidizi wa kiufundi pekee na si mbinu inayotumika ya kuhamisha data yako</1>

source: Menu
sw_ke: Menyu

source: Close
sw_ke: Funga

source: Next
sw_ke: Inayofuata

source: Not accepted as correct
sw_ke: Haikubaliki kama sahihi

source: Verification
sw_ke: Uthibitishaji

source: Thanks for sending in your record. From this record details, we think it could be the <1>{{taxonName}}</1> species.
sw_ke: Asante kwa kutumia rekodi yako. Kutoka kwa maelezo ya rekodi hii, tunafikiri inaweza kuwa<1>{{jina jumla ya kisayansi}}</1> aina.

source: Thanks for sending in your record. A verifier has marked it as <2>"{{statusMessage}}"</2> in this case.
sw_ke: Asante kwa kutuma rekodi yako. Kithibitishaji kimeiweka alama kama <2>"{{ujumbe wa kuonyesha hali}}"</2> kwa wakati huu.

source: Please log in to the iRecord website to see any additional information that the verifier may have provided.
sw_ke: Tafadhali ingia kwenye tovuti ya iRecord ili kuona maelezo yoyote ya ziada ambayo mthibitishaji anaweza kuwa ametoa.

source: Details
sw_ke: Maelezo

source: Verified by:
sw_ke: Imethibitishwa na:

source: Verified on:
sw_ke: Imethibitishwa mnamo:

source: Accepted as correct
sw_ke: Imekubaliwa kama sahihi

source: Thanks for sending in your record.
sw_ke: Asante kwa kutuma rekodi yako.
